#+BEGIN_SRC sh :results output
which ruby
ruby -v
rbenv version
rbenv help
rbenv global 2.0.0-dev
rbenv version
#+END_SRC

#+RESULTS:
#+begin_example
/home/staff/suzuki/.rbenv/shims/ruby
ruby 2.3.0dev (2015-09-14 trunk 51856) [x86_64-linux]
2.0.0-dev (set by /home/staff/suzuki/.rbenv/version)
Usage: rbenv <command> [<args>]

Some useful rbenv commands are:
   commands    List all available rbenv commands
   local       Set or show the local application-specific Ruby version
   global      Set or show the global Ruby version
   shell       Set or show the shell-specific Ruby version
   rehash      Rehash rbenv shims (run this after installing executables)
   version     Show the current Ruby version and its origin
   versions    List all Ruby versions available to rbenv
   which       Display the full path to an executable
   whence      List all Ruby versions that contain the given executable

See `rbenv help <command>' for information on a specific command.
For full documentation, see: https://github.com/sstephenson/rbenv#readme
2.0.0-dev (set by /home/staff/suzuki/.rbenv/version)
#+end_example



